RANDOM_CHOICE_MENU_BUTTON = "Ответь мои на вопросы!"
RANDOM_CHOICE_BUTTON = "Крутануть шар с предсказаниями"
HOROSCOPE_MENU_BUTTON = "Покажи мою судьбу!"
INITIAL_MENU = "Надоело, давай назад!"

HOROSCOPE_PERIOD_LIST = {
    "На сегодня": "today",
    "На неделю": "weekly",
    "На месяц": "monthly",
}

QUOTES_BUTTON_LIST = [
    "ЖГИ!",
    "РВИ ДУШУ!",
    "ЕЩЕ!",
    "МОАР!",
    "ДАВААААЙ!",
    "ДА! ЕЩЕ!",
    "БОЖЕ, АФТАР, ПЛАКАЮ!",
    "ДЕВАЧКИ, ПЛАЧУ!",
]

HOROSCOPE_BUTTON_LIST = {
    "Овен": "aries",
    "Телец": "taurus",
    "Близнецы": "gemini",
    "Рак": "cancer",
    "Лев": "leo",
    "Дева": "virgo",
    "Весы": "libra",
    "Скорпион": "scorpio",
    "Стрелец": "sagittarius",
    "Козерог": "capricorn",
    "Водолей": "aquarius",
    "Рыбы": "pisces",
}

RANDOM_CHOICE_MESSAGE_LIST = [
    "Пока не понятно",
    "Скорее нет, чем да",
    "Скорее да, чем нет",
    "Это очень неопределенно",
    "Попробуй еще раз",
    "Определенно да",
    "Да",
    "Нет",
    "Определенно нет",
    "Скоро все прояснится",
    "Нужно больше времени",
    "Я не знаю ответа на этот вопрос",
    "Ты меня еще долго доставать будешь?",
]

NAVIGATION_MESSAGE_LIST = [
    "Погнали!",
    "Погнали",
    "пагнали",
    "Да тебе не угодишь, е-мое, хватит гонять меня!",
    "Е-мое, хватит шастать туда-сюда!",
    "Погнали, расскажу тебе все!",
    "Ну погнали...",
    "Опять?",
    "Определись уже!",
]
