RANDOM_CHOICE_MENU_BUTTON = "Ответь мои на вопросы!"
RANDOM_CHOICE_BUTTON = "Крутануть шар с предсказаниями"
INITIAL_MENU = "Надоело, давай назад!"
THANKS = "Спасибки!"

HOROSCOPE_PERIOD_LIST = {
    "На сегодня": "today",
    "На неделю": "weekly",
    "На месяц": "monthly",
}

QUOTES_BUTTON_LIST = [
    "ЖГИ!",
    "РВИ ДУШУ!",
    "ЕЩЕ!",
    "МОАР!",
    "ДАВААААЙ!",
    "ДА! ЕЩЕ!",
    "БОЖЕ, АФТАР, ПЛАКАЮ!",
    "ДЕВАЧКИ, ПЛАЧУ!",
]

HOROSCOPE_BUTTON_LIST = {
    "Овен": "aries",
    "Телец": "taurus",
    "Близнецы": "gemini",
    "Рак": "cancer",
    "Лев": "leo",
    "Дева": "virgo",
    "Весы": "libra",
    "Скорпион": "scorpio",
    "Стрелец": "sagittarius",
    "Козерог": "capricorn",
    "Водолей": "aquarius",
    "Рыбы": "pisces",
}

RANDOM_CHOICE_MESSAGE_LIST = [
    "Пока не понятно",
    "хз",
    "Скорее нет, чем да",
    "Скорее да, чем нет",
    "хз, мне кажется нет. Ну и вопросы у тебя",
    "Это очень неопределенно",
    "Попробуй еще раз",
    "Определенно да",
    "Да",
    "Нет",
    "Определенно нет",
    "Скоро все прояснится",
    "Нуу, наверное, да, хз",
    "Нужно больше времени",
    "Я не знаю ответа на этот вопрос",
    "хз, не знаю, иди еще гороскопы почитай",
    "Ты меня еще долго доставать будешь?",
    "Тебе не кажется, что ты задаешь иногда тупые вопросы?",
]

NAVIGATION_MESSAGE_LIST = [
    "Погнали!",
    "Погнали",
    "пагнали",
    "Да тебе не угодишь, е-мое, хватит гонять меня!",
    "Е-мое, хватит шастать туда-сюда!",
    "Погнали, расскажу тебе все!",
    "Ну погнали...",
    "Опять?",
    "Определись уже!",
]

SMILE_LIST = [
    "😀", "😃", "😄", "😁", "😆",
    "☺", "😊", "😇", "🙂", "🙃",
    "😉", "😌", "😍", "🥰", "😘",
    "😗", "😙", "😚", "😎", "😏",
    "🥺", "😱", "🤗", "🤭", "😺",
    "😸", "😻", "😽",
]

WELCOME_LIST = [
    "Позязя",
    "Чмоке",
    "Лю Тя",
    "лютя",
    "Чмафки",
    "Тебе спасибо",
    "Чмоки",
]
